{
  "VtnH0B1ZZ08": {
    "video_info": {
      "id": "VtnH0B1ZZ08",
      "url": "https://www.youtube.com/watch?v=VtnH0B1ZZ08",
      "title": "DNA, Symbols, and Ancient Intervention",
      "published": "2025-05-27T00:00:38Z"
    },
    "comments": [
      {
        "author": "@AlishaJohnson-i2g6c",
        "text": "Disgusting 😢",
        "likes": 0,
        "published": "2025-05-27T01:09:09Z",
        "updated": "2025-05-27T01:09:09Z"
      },
      {
        "author": "@agethauno6592",
        "text": "Is it the book of Enoch that mentions The fallen angels who taught us how to make medicine, weapons, and some other stuff? I don&#39;t study this stuff, just sounds familiar",
        "likes": 1,
        "published": "2025-05-27T00:35:30Z",
        "updated": "2025-05-27T00:35:30Z"
      },
      {
        "author": "@spitfirered",
        "text": "👍👍👀👀❤❤💯💯⁉⁉👏👏",
        "likes": 0,
        "published": "2025-05-27T00:34:05Z",
        "updated": "2025-05-27T00:34:05Z"
      },
      {
        "author": "@angelaverbowski995",
        "text": "Crisper  is made to do exactly that!<br>And it&#39;s been around for almost ten years and no one is talking about it!!<br>🧐🧐🤔🤔😨😥",
        "likes": 0,
        "published": "2025-05-27T00:30:23Z",
        "updated": "2025-05-27T00:30:23Z"
      },
      {
        "author": "@Thecommon4321",
        "text": "If some one has a really long nose you know they are full of lies and deception",
        "likes": 0,
        "published": "2025-05-27T00:25:21Z",
        "updated": "2025-05-27T00:25:21Z"
      },
      {
        "author": "@marcusyoung9741",
        "text": "Close but no cigar…<br>We’re being treated like the demons we’ve been in the hope that souls will awaken.<br>Junkies.<br>That’s what you get for your addiction to staring into the face of God forever, RUDE AWAKENING.",
        "likes": 0,
        "published": "2025-05-27T00:24:32Z",
        "updated": "2025-05-27T00:24:32Z"
      },
      {
        "author": "@Rocket39Smoke14",
        "text": "So, Aliens with long tails, are responsible for Man-Made Climate Change™?",
        "likes": 0,
        "published": "2025-05-27T00:20:27Z",
        "updated": "2025-05-27T00:21:13Z"
      },
      {
        "author": "@jorgeyaquilugobeltran",
        "text": "it makes sense. lfg",
        "likes": 0,
        "published": "2025-05-27T00:19:40Z",
        "updated": "2025-05-27T00:19:40Z"
      },
      {
        "author": "@Amandalynn6350",
        "text": "Figure it out. ❤",
        "likes": 1,
        "published": "2025-05-27T00:14:15Z",
        "updated": "2025-05-27T00:14:15Z"
      },
      {
        "author": "@douglascooper1987",
        "text": "If someone would just explain the Human Fascination with Gold.🤷",
        "likes": 2,
        "published": "2025-05-27T00:10:48Z",
        "updated": "2025-05-27T00:10:48Z"
      },
      {
        "author": "@therealpatriarchy",
        "text": "Simians imitate. All you have to do is model bad behavior.",
        "likes": 1,
        "published": "2025-05-27T00:08:03Z",
        "updated": "2025-05-27T00:08:03Z"
      }
    ],
    "comment_count": 11
  },
  "fUmXPXp6AVE": {
    "video_info": {
      "id": "fUmXPXp6AVE",
      "url": "https://www.youtube.com/watch?v=fUmXPXp6AVE",
      "title": "Did Tonga Skew the Climate Narrative?",
      "published": "2025-05-26T18:00:42Z"
    },
    "comments": [
      {
        "author": "@jameswickman3792",
        "text": "The best comic relief is reading these comments. Randall isn&#39;t denying CO2, what he is pointing out is there is an establishment using this narrative for control using fear. But for me it is also important on the geologic truth narrative that there is more than what is being said. There are many contributing factors to climate change. Many happen without human additions. Poles shift and have been currently. Ice ages happened. Science is still trying to understand what it is. To deny is to be an ostrich",
        "likes": 0,
        "published": "2025-05-27T01:19:55Z",
        "updated": "2025-05-27T01:19:55Z"
      },
      {
        "author": "@chrisgriffiths2533",
        "text": "Not exactly correct.<br>One of the major concerns, possible Tipping Points is that We fill the Atmosphere too much with Fumes.<br>Then a Natural Event (Volcanoe) Triggers a Climate Tipping Point.",
        "likes": 0,
        "published": "2025-05-27T01:19:54Z",
        "updated": "2025-05-27T01:19:54Z"
      },
      {
        "author": "@bobmcdermit9857",
        "text": "Climate change&#39;s end game is social control? How dumb are you?",
        "likes": 0,
        "published": "2025-05-27T01:04:00Z",
        "updated": "2025-05-27T01:04:00Z"
      },
      {
        "author": "@craigknapp6318",
        "text": "I recall doing some calculations at the time of the water vapor injection into the atmosphere from this activity. It was something like 10 to 15% of the amount of moisture in the atmosphere. How could a sudden injection of that much water vapor not affect weather immediately.?",
        "likes": 0,
        "published": "2025-05-27T00:32:07Z",
        "updated": "2025-05-27T00:32:07Z"
      },
      {
        "author": "@Governmentiscorrupt",
        "text": "If we spend more on climate tax we will solve global warming...even though the earth is cooling...if that makes sense.",
        "likes": 0,
        "published": "2025-05-27T00:22:28Z",
        "updated": "2025-05-27T00:22:28Z"
      },
      {
        "author": "@almushanners710",
        "text": "Yep,  learned that in high school",
        "likes": 0,
        "published": "2025-05-27T00:21:34Z",
        "updated": "2025-05-27T00:21:34Z"
      },
      {
        "author": "@Hfabf",
        "text": "Sir, you are spreading misinformation and are obviously playing politics with the climate. There are scientists who study climate change and tell us exactly what is happening with regard to climate change. You are not a climatologist nor have you studied climatology in the field. Please stop being so irresponsible",
        "likes": 0,
        "published": "2025-05-27T00:18:09Z",
        "updated": "2025-05-27T00:18:09Z"
      },
      {
        "author": "@doggletamer",
        "text": "Water vapor is a greenhouse gas.",
        "likes": 2,
        "published": "2025-05-27T00:12:59Z",
        "updated": "2025-05-27T00:12:59Z"
      },
      {
        "author": "@still_in_hue",
        "text": "what did 2100 nukes do to long term climate conditions??? asking for friend.",
        "likes": 0,
        "published": "2025-05-27T00:03:18Z",
        "updated": "2025-05-27T00:03:18Z"
      },
      {
        "author": "@williamevans6522",
        "text": "Dihydrogen monoxide  is the worst  greenhouse  gas😊",
        "likes": 0,
        "published": "2025-05-27T00:03:00Z",
        "updated": "2025-05-27T00:03:00Z"
      },
      {
        "author": "@stanbaucom3464",
        "text": "Was Honga Tonga a man made underwater bomb?",
        "likes": 0,
        "published": "2025-05-26T23:55:44Z",
        "updated": "2025-05-26T23:55:44Z"
      },
      {
        "author": "@Charles_Michael_King",
        "text": "Dude as soon as that water vapor hits 30 thousand feet, it will freeze... not stay hot for months at a time! Randall has read too many books and i think he talks too much",
        "likes": 0,
        "published": "2025-05-26T23:52:46Z",
        "updated": "2025-05-26T23:52:46Z"
      },
      {
        "author": "@nzmeateater",
        "text": "My wife heard that explosion in New Zealand thousands of kms away.",
        "likes": 4,
        "published": "2025-05-26T23:51:29Z",
        "updated": "2025-05-26T23:51:29Z"
      },
      {
        "author": "@DamianLewd",
        "text": "The trend is to focus on the “people generated” climate change … well yeah👀",
        "likes": 0,
        "published": "2025-05-26T23:37:32Z",
        "updated": "2025-05-26T23:37:32Z"
      },
      {
        "author": "@TRUTH6325",
        "text": "It appears that the democrat party is using false claims of climate change to raise taxes, and deceive the truth as a method of control.",
        "likes": 0,
        "published": "2025-05-26T23:33:36Z",
        "updated": "2025-05-26T23:33:55Z"
      },
      {
        "author": "@Drdum123",
        "text": "And dont forget to wet winter on the us west coast.... it was an epic year",
        "likes": 0,
        "published": "2025-05-26T23:31:43Z",
        "updated": "2025-05-26T23:31:43Z"
      },
      {
        "author": "@novascotiasleepsounds6446",
        "text": "We had major flooding in nova scotia that i think is linked to this",
        "likes": 0,
        "published": "2025-05-26T23:23:15Z",
        "updated": "2025-05-26T23:23:15Z"
      },
      {
        "author": "@cranberryeater7459",
        "text": "Global Warming? <br><b>STOP WATER VAPOR</b>",
        "likes": 0,
        "published": "2025-05-26T23:19:53Z",
        "updated": "2025-05-26T23:19:53Z"
      },
      {
        "author": "@oldie4210",
        "text": "The scientists predicted 4 to 10 years of changes. They could only speculate that weather changes would be more abrupt in their cycles, as it has not happened in recorded time. Major media did the usual coverup and or downplay",
        "likes": 3,
        "published": "2025-05-26T23:10:56Z",
        "updated": "2025-05-26T23:10:56Z"
      },
      {
        "author": "@ibethebandu.a.morrison653",
        "text": "Spreading bullshit, what a disappointment",
        "likes": 0,
        "published": "2025-05-26T23:07:49Z",
        "updated": "2025-05-26T23:07:49Z"
      },
      {
        "author": "@aynjeleyes",
        "text": "I am about 3000km from that explosion. I heard it whilst on my ride on mower. I stopped mowing removed my head phones and looked around for the military jet I thought that made the explosion. then I heard the second explosion. Less then 2 months later we had a 1 in a 1000 year flood. But the government &amp; bom said the volcano had nothing to do with the weather.",
        "likes": 5,
        "published": "2025-05-26T23:07:23Z",
        "updated": "2025-05-26T23:07:23Z"
      },
      {
        "author": "@pauldusa",
        "text": "Spring 2025 is colder in pa than usual",
        "likes": 0,
        "published": "2025-05-26T22:58:56Z",
        "updated": "2025-05-26T22:58:56Z"
      },
      {
        "author": "@ChrisField-rh2ck",
        "text": "Human caused climate change is a hoax",
        "likes": 0,
        "published": "2025-05-26T22:58:54Z",
        "updated": "2025-05-26T22:58:54Z"
      },
      {
        "author": "@benspeller8635",
        "text": "Bullshit",
        "likes": 0,
        "published": "2025-05-26T22:50:52Z",
        "updated": "2025-05-26T22:50:52Z"
      },
      {
        "author": "@Flap999",
        "text": "Oh boy, now you did it, you got on the wrong side of the green religion",
        "likes": 0,
        "published": "2025-05-26T22:46:27Z",
        "updated": "2025-05-26T22:46:27Z"
      },
      {
        "author": "@richard-cf8ce",
        "text": "CLIMATE CHANGE IS AS FAKE AS COVID VACCINES",
        "likes": 0,
        "published": "2025-05-26T22:31:09Z",
        "updated": "2025-05-26T22:31:09Z"
      },
      {
        "author": "@fredisfredisfred",
        "text": "The FACT that I saw these reports on water vapor and the like in the news, many times, from several different sources, tells me you are promoting your own agenda. Nobody is hiding anything and the overwhelming consensus is man made climate change is real and is an existential threat. Downplaying it with conspiracy theories about &quot;social control&quot; is irresponsible.",
        "likes": 0,
        "published": "2025-05-26T22:31:03Z",
        "updated": "2025-05-26T22:31:03Z"
      },
      {
        "author": "@Collie5870",
        "text": "It was a missile 😂 you could see the missile in flight going into the water. They were trying set off a fault line. 😂😂",
        "likes": 0,
        "published": "2025-05-26T22:29:14Z",
        "updated": "2025-05-26T22:29:14Z"
      },
      {
        "author": "@BobWard-p4d",
        "text": "Global warming is a SCAM!!!",
        "likes": 0,
        "published": "2025-05-26T22:12:25Z",
        "updated": "2025-05-26T22:12:25Z"
      },
      {
        "author": "@mitchconner2021",
        "text": "Didnt antartica gain a ton of ice this year?",
        "likes": 4,
        "published": "2025-05-26T22:07:17Z",
        "updated": "2025-05-26T22:07:17Z"
      },
      {
        "author": "@kevinmonahan5425",
        "text": "Every video of actual scientists like Randall Carlson destroying the anthropomorphic climate change narrative has the ‘Climate Change’ definition automatically posted beneath the title of the video shooting the theory down in flames.",
        "likes": 0,
        "published": "2025-05-26T22:02:42Z",
        "updated": "2025-05-26T22:02:42Z"
      },
      {
        "author": "@Michaelroni-n-cheese",
        "text": "I love Randall but my biggest hangup is that I have really not seen this supposed denial of natural cycles or intent towards asserting that all of climate change is human caused only.  I am very current and diligent in my research and oppositional research and cannot locate the supposed misleading of everyone.  Yeah, there was a short period in the 2010s when general understanding was very incorrect, and you saw people like Al Gore advocating it, but he didnt get elected and its not like you&#39;re seeing constructing regulations or mandates rooted in this thought. In fact, I prevalently see the opposite and a ubiquitous apathy towards lowering our pollution due to shameless companies doing what they want either way.  Ive mostly observed that environmentally conscious individuals are more focused the the irrefutable evidence pointing towards how our pollution and poor environmental regulations are allowing corporations to inundate our descendents with cancer or dementia while refusing to acknowledge or take steps to minimize this.  Furthermore nearly every clean energy supporter understands that it will be a very long time before you could phase out emission making combustion energy, but that there is not harm in both provressing clean power efficiency and facilities.  In fact, most advocates fully accept that the earth will do what it does despite us, but that the undeniably vast amounts of emmissions we create absolutely speeds the warming process up and gives us less time to create countermeasures to avoid total collapse.  The endless drive for profit has lead to a dynamic in which loopholes for road safety policies led to 80% of civilian vehicals being large impractical trucks that counterproductively guzzle expensive and limited fuel while significantly lowering your chance of surviving and accident.<br><br>Like, the US literally just removed regulations that ban companies from dumping carcinogenic pollution near residential districts.  They just increased the acceptable amount of fecal matter allowed in municipal drinking supplies. They removed rigorous agricultural inspections.  They defunded the organization that inspects air scrubbers for factories.  Theyre currently trying to remove the restrictions that force companies to disclose the materials in medical devices.  They built an entire ev infrastructure around lithium batteries in order to corner the market despite their harmful production methods, and the clear progress made towards more practical technologies like soliid state batteries.  <br><br>When it comes to climate change I see great benefit in developing more efficient and durable wind, water, sun, geothermal as a preparation for the inevitably of major climate change.  Considering how likely it is that those conditions will induce a huge population decrease that will leave those left unable to operate the insanely widespread and complex energy infrastructure we currently rely on.  You bet your ass you&#39;d be grateful for a long lasting heavy duty battery powering your volcanic winter shelter.  You wont have access to fuel to the gargantuan tools required to extract it so an efficient solar/geo/momentum generator would be the only way to power neccesary technologies and avoid a complete technological regression.<br><br>You guys gott a stop letting Joe Rogan and alike convince you your existence is under attack by some demographic of short sighted libs who just want to take your trucks and gas stoves because they hate you.  Randall even frequently references the futility and manipulative reasons there is such a major media focus on team based politics.  No 2 humans hokd the exact same perception or understanding of the complex affects of our technology and I know plenty of Colorado right wingers who&#39;d be considered a commie in ny honetown in Oklahoma.  The dramatic broadcasting of our theatrical politics does not represent any group unanimously and despite the fact that nearly all of you know this you still drink the koolaid and jump on the adversarial train every chance you get.  You are aware that this is a tactic to keep those without wealth focused on imagined enemies inorder to deffer condemnation and accountability for thise pushing the idea that we cant cooperate , yet your childish inferiority complex prevents you from objectively considering the humanity of thise with opposing views.  There has never been a push to ban gas appliances and there likely will not be until there is enough progress for alternatives which takes engineering and time.  There was a single private research program that extensively studied how gas appliances objectively lead to lower oxygen purity and higher pollutant levels inside of a hone which has been proven to lower cognitive function, increase asthma, increase cancer, and increases risks of house fires, but there was never wven a proposed intention to ban them, barring the minimal tax credits offered to those helping to facilitate the gradual transition towards posessing energy sources that people can directly use instead of our current reliance on private corps to fairly and competently distribute it.  The institution want you to fill your house with gas so you have too much brain fog to critically observe the lack of transparency and consideration towards our health and safety.",
        "likes": 0,
        "published": "2025-05-26T21:55:44Z",
        "updated": "2025-05-26T21:56:15Z"
      },
      {
        "author": "@thomasmceiver236",
        "text": "Unfortunately the programmed people cannot believe, or trust, your truth.  You first need to break their trance, before the truth",
        "likes": 0,
        "published": "2025-05-26T21:54:53Z",
        "updated": "2025-05-26T21:54:53Z"
      },
      {
        "author": "@slickwillie9526",
        "text": "Randal is correct. All roads lead to Climate Change for one reason - $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$...",
        "likes": 0,
        "published": "2025-05-26T21:47:44Z",
        "updated": "2025-05-26T21:47:44Z"
      },
      {
        "author": "@coreytheecorey4056",
        "text": "People forget that just 50 years ago we were worried about global cooling…. And arguing about climate change has set the human race back another 50 years from understanding its cycles.",
        "likes": 15,
        "published": "2025-05-26T21:45:46Z",
        "updated": "2025-05-26T21:45:46Z"
      },
      {
        "author": "@markstuckless5039",
        "text": "globalists are evil",
        "likes": 0,
        "published": "2025-05-26T21:45:25Z",
        "updated": "2025-05-26T21:45:25Z"
      },
      {
        "author": "@bigjax-lf7jr",
        "text": "I&#39;ve been saying this since that underwater volcano erupted",
        "likes": 0,
        "published": "2025-05-26T21:41:46Z",
        "updated": "2025-05-26T21:41:46Z"
      },
      {
        "author": "@timhamby4977",
        "text": "💯",
        "likes": 0,
        "published": "2025-05-26T20:46:59Z",
        "updated": "2025-05-26T20:46:59Z"
      },
      {
        "author": "@msspears8915",
        "text": "The media is lying to use because fear baiting is better for earning money",
        "likes": 0,
        "published": "2025-05-26T20:44:56Z",
        "updated": "2025-05-26T20:44:56Z"
      },
      {
        "author": "@AmericatheBeautiful-p4z",
        "text": "During COV20 Summer we had the hammock in the yard all summer and peak end-of-July had to sleep under a net and a sheet it got so hot in PacNW. But by 2023&#39;s winter, when a dry lake bed the size of Costa Rica refilled after 114 years, every summer since, no hammock, and in 2024, the late June COLD killed the tomato starts. This winter 2025 was the coldest on record, but ... then March showers brought April flowers, then cool clear beautiful April was one of the best Springs starts ever. We&#39;re still in the low 50Fs overnight perfect sleeping weather, maybe this summer we can hang the hammock back up!!",
        "likes": 2,
        "published": "2025-05-26T20:40:54Z",
        "updated": "2025-05-26T20:40:54Z"
      },
      {
        "author": "@negrosurgeon",
        "text": "Fossil fuels do not harm the environment. Electric vehicles do, especially when they are everywhere broke down and leaking lithium and heavy metals into our ground water that&#39;s going to ruin the entire world",
        "likes": 0,
        "published": "2025-05-26T20:37:02Z",
        "updated": "2025-05-26T20:37:02Z"
      },
      {
        "author": "@ArizumaDT",
        "text": "@LEGALAF @MEIDASTOUCH",
        "likes": 0,
        "published": "2025-05-26T20:25:56Z",
        "updated": "2025-05-26T20:25:56Z"
      },
      {
        "author": "@Bunnyymann",
        "text": "Adapt2030 covered this almost from the get go when it blew up. He talked about it often  and had the charts and data to back it up",
        "likes": 0,
        "published": "2025-05-26T20:24:26Z",
        "updated": "2025-05-26T20:24:26Z"
      },
      {
        "author": "@Liseannhart",
        "text": "Agrée 👍",
        "likes": 0,
        "published": "2025-05-26T20:19:43Z",
        "updated": "2025-05-26T20:19:43Z"
      },
      {
        "author": "@brilafable",
        "text": "Well said Randall... its about complete control of the people..",
        "likes": 29,
        "published": "2025-05-26T20:19:09Z",
        "updated": "2025-05-26T20:19:09Z"
      },
      {
        "author": "@JohnJoynson",
        "text": "And coming out of an ice age, has no impact on rising mean annual temperature.",
        "likes": 0,
        "published": "2025-05-26T20:18:15Z",
        "updated": "2025-05-26T20:18:15Z"
      },
      {
        "author": "@georgepaiva7496",
        "text": "And the left didn’t waste making up an emergency on this for their gain",
        "likes": 0,
        "published": "2025-05-26T20:11:53Z",
        "updated": "2025-05-26T20:11:53Z"
      },
      {
        "author": "@-LightningRod-",
        "text": "Bumble Carlson pretending he is an expert again,..<br>it&#39;s HILARIOUS that people think this guy is legitimate.",
        "likes": 2,
        "published": "2025-05-26T19:48:28Z",
        "updated": "2025-05-26T19:48:28Z"
      },
      {
        "author": "@sherbetdab6066",
        "text": "What a Name!!😂😂",
        "likes": 0,
        "published": "2025-05-26T19:42:52Z",
        "updated": "2025-05-26T19:42:52Z"
      },
      {
        "author": "@focusonrevenues",
        "text": "Man made climate change has always and will always be a myth.",
        "likes": 1,
        "published": "2025-05-26T19:15:19Z",
        "updated": "2025-05-26T19:15:19Z"
      }
    ],
    "comment_count": 50
  }
}